Tekla.Structures.Analysis.AnalysisLoadCombination.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisLoadCombination class.

Tekla.Structures.Analysis.AnalysisLoadCombination.Name
Gets or sets the name of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.Type
Gets or sets the combination type of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.GroupIDs
Gets or sets the identifiers of the groups of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.ScalingFactors
Gets or sets the scaling factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.ReductionFactors
Gets or sets the reduction factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.PartialSafetyFactors
Gets or sets the partial safety factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.Select
Selects an analysis load combination.
The AnalysisModelName and ID have to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.Modify
Modifies an analysis load combination.
The AnalysisModelName and ID have to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.Delete
Deletes an analysis load combination.
The AnalysisModelName and ID have to be set.